<img src='images/Used_cars.jpg'>

### Introduction

**According to Stats:** The Indian used car market was valued at USD 24.24 billion in 2019, and it is expected to register CAGR(Compound Annual Growth Rate) of 15.12 % during the forecast period(2020-2025). 

Well this expected rate can fluctuate due to COVID-19 situation, which is pretty obvious. Despite of this, India has a huge market base as far as second hand cars are concerned due to various reasons:
   * Saves Money
   * Upgrade Segment For Less
   * Drive Tension Free
   * Cheaper Insurance
   * Slower Depreciation
---

**Example:**<br>
A New Maruti Suzuki Swift Lxi in New Delhi<br>
`Price`:           Rs. 5,73,000<br>
`RTO`:             Rs. 31,920<br>
`Insurance`:       Rs. 35,111<br>
`FASTag`:          Rs. 500<br>
**Total Cost** - Rs. 6,40,531

Suppose if you look for 1 year old car, same model, 10000 km driven, it would cost you around Rs.5,40,00(considering depreciation), which is a steal.

### Problem Statement

**From Seller's Perspective:**
The main problem faced by the seller is to list a fair price for their used car based on the condition and specifications of the car like kms driven, model, mileage, wear and tear etc. They may list very low price or very high price due to which they fail to sell it.

**From Buyer's Perspective:**
There is a risk of paying wrong prices when buying a used car, you must know the workarounds of used car evaluations. Owners or dealers ask for wrong amount to fraud you by earning more profits out of low priced car. 

**OBJECTIVE:** To train a model which can predict the price of the used car based on different features such as kms driven, mileage, model, year of purchase, owner type etc.

### Data Description

This dataset is obtained from <a href="https://www.kaggle.com/avikasliwal/used-cars-price-prediction?select=train-data.csv">Kaggle</a>

It consists of two subset: 
* train-data: There are 6018 rows and 14 cols in the training set.
* test-data: There are 1234 rows and 14 cols in the testing set.

**Feature Description:**
* `Name`: The brand and model of the car.
* `Location`: The location in which the car is being sold or is available for purchase.
* `Year`: The year or edition of the model.
* `Kilometers_Driven`: The total kilometers driven by the previous owner(s).
* `Fuel_Type`: The type of fuel used by the car (Petrol, Diesel, Electric, CNG, LPG).
* `Transmission`: The type of transmission used by the car (Automatic, Manual).
* `Owner_Type`: (First Owner, Second Owner).
* `Mileage`: Standard mileage offered by the car company in km/lts or km/kg.
* `Engine`: The displacement volume of engine in CC.
* `Power`: The maximum power of the engine in bhp.
* `Seats`: The number of seats in a car.
* `New_Price`: The price of a new car of the same model in INR(lakhs).
* `Price`: The price of the used car in INR(lakhs)

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
# import essential libraries
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

### Understand the Data

In [3]:
# load data from csv file
df_train = pd.read_csv('data/train-data.csv').drop('Unnamed: 0', axis=1)
df_test = pd.read_csv('data/test-data.csv').drop('Unnamed: 0', axis=1)

In [4]:
# print few lines of training set
df_train.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [5]:
# print few lines of testing set
df_test.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price
0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,NaN
1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.7 kmpl,796 CC,47.3 bhp,5.0,NaN
2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68 kmpl,2393 CC,147.8 bhp,7.0,25.27 Lakh
3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59 kmpl,1364 CC,null bhp,5.0,NaN
4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.5 kmpl,1197 CC,82.85 bhp,5.0,NaN

In [6]:
# Shape of dataset
# Price is not given in testing set.
print(f"There are {df_train.shape[0]} rows and {df_train.shape[1]} columns in the training set.")
print()
print(f"There are {df_test.shape[0]} rows and {df_test.shape[1]} columns in the testing set.")

There are 6019 rows and 13 columns in the training set.

There are 1234 rows and 12 columns in the testing set.

In [7]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 13 columns):
Name                 6019 non-null object
Location             6019 non-null object
Year                 6019 non-null int64
Kilometers_Driven    6019 non-null int64
Fuel_Type            6019 non-null object
Transmission         6019 non-null object
Owner_Type           6019 non-null object
Mileage              6017 non-null object
Engine               5983 non-null object
Power                5983 non-null object
Seats                5977 non-null float64
New_Price            824 non-null object
Price                6019 non-null float64
dtypes: float64(2), int64(2), object(9)
memory usage: 611.4+ KB

**NOTE:** Some of the columns have null values: `Mileage`, `Engine`, `Power`, `Seats`, `New_Price`

In [8]:
df_train[['Kilometers_Driven', 'Seats', 'Price']].describe()

       Kilometers_Driven        Seats        Price
count       6.019000e+03  5977.000000  6019.000000
mean        5.873838e+04     5.278735     9.479468
std         9.126884e+04     0.808840    11.187917
min         1.710000e+02     0.000000     0.440000
25%         3.400000e+04     5.000000     3.500000
50%         5.300000e+04     5.000000     5.640000
75%         7.300000e+04     5.000000     9.950000
max         6.500000e+06    10.000000   160.000000

**NOTE:** The minimum value of `Seats` column is 0.0 which needs to be taken care of.

In [9]:
num_cols = df_train.select_dtypes(include=np.number).columns.values
print(f"Numerical Columns: \n{', '.join(num_cols)}")

cat_cols = df_train.select_dtypes(exclude=np.number).columns.values
print(f"\nCategorical Columns: \n{', '.join(cat_cols)}")

Numerical Columns:
Year, Kilometers_Driven, Seats, Price

Categorical Columns:
Name, Location, Fuel_Type, Transmission, Owner_Type, Mileage, Engine, Power, New_Price

**NOTE:** Mileage, Engine and Power should be numerical values, but due to their units, they are considered as categorical columns. Let's preprocess the data to fix this.

### Data Pre-processing

#### Dealing with Missing Values

In [10]:
# Missing values
print(f"\033[1mTRAINING SET\033[0m")
print(df_train.isnull().sum())

print(f"\n\033[1mTESTING SET\033[0m")
print(df_test.isnull().sum())

TRAINING SET
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

TESTING SET
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 10
Power                  10
Seats                  11
New_Price            1052
dtype: int64

Replace missing values in `Seats` column by mode. <br>
**Reason**: There is only small proportion of seats with missing values(0.69%), we can impute them with the most common values of seats in the dataset(i.e. 5).

In [11]:
round((df_train['Seats'].isnull().sum() / len(df_train)) * 100, 3)

0.698

In [12]:
value = df_train['Seats'].mode()[0]

df_train['Seats'].fillna(value=value, inplace=True)
df_test['Seats'].fillna(value=value, inplace=True)

In [13]:
# Missing values
print(f"\033[1mTRAINING SET\033[0m")
print(df_train.isnull().sum())

print(f"\n\033[1mTESTING SET\033[0m")
print(df_test.isnull().sum())

TRAINING SET
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                   0
New_Price            5195
Price                   0
dtype: int64

TESTING SET
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 10
Power                  10
Seats                   0
New_Price            1052
dtype: int64

In [14]:
df_train[df_train['Seats'] == 0]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
3999,Audi A4 3.2 FSI Tiptronic Quattro,Hyderabad,2012,125000,Petrol,Automatic,First,10.5 kmpl,3197 CC,null bhp,0.0,NaN,18.0

In [15]:
# One of the value in Seats is 0.0 which I have Noted earlier in first Step(Understanding the data).
# Replace the value with the mode of 'Seats' column i.e. 5.0
df_train['Seats'][df_train['Seats'] == 0.0] = 5.0

Replace missing values in `Mileage` column by mode. <br>
**Reason**: There is only small proportion of missing values(0.03%), we can impute them with the most common values of `Mileage` in the dataset(i.e. 17.0). But before that I have to remove the units and convert it into numerical type.

In [19]:
round((df_train['Mileage'].isnull().sum() / len(df_train)) * 100, 3)

0.033

In [46]:
# Remove units (km/kg or kmpl)
df_train['Mileage'] = df_train['Mileage'].str.split(' ').str[0]